---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShape.RebarStyle
source: html/ec72e836-ea5a-8d74-40f0-55344ae095bd.htm
---
# Autodesk.Revit.DB.Structure.RebarShape.RebarStyle Property

Whether the shape represents a standard bar or a stirrup.

## Syntax (C#)
```csharp
public RebarStyle RebarStyle { get; }
```